import streamlit as st
import numpy as np
import os

os.system("cls")
import sys
import pandas as pd
import matplotlib.pyplot as plt
fig, ax = plt.subplots()

col1, col2 = st.columns([1 , 2])
with col1:
    st.image('meme.jpg')
with col2:
    "재난안전소방학과 19학번 이동영"
    "전화번호 : 010-2990-6592"
    "이메일 : ehdduddlrnt@naver.com"
    "주소 : 충청남도 논산시 은진면 교와 10길 아름찬 106호"
'---------------------------------------------------------------------'
col1, col2, col3 = st.columns(3)
with col1:
    st.link_button("google(👍🏻)", "https://google.com")
with col2:
    st.link_button("naver(✅)", "https://naver.com")
with col3:
    st.link_button("건양대학교(❤️)", "https://www.konyang.ac.kr/kor.do")


''
''
'## :yellow[자 기 소 개]'

"#### 안녕하세요 재난안전소방학과 19학번 이동영이라고 합니다."
"#### 저는 건양대학교를 다니면서 저를 향상시키고자 노력을 많이 했습니다."
"#### 1학년과 2학년때에는 대학 생활을 시작하면서 놀 생각을 더 많이 했던거 같습니다. 너무 놀았던건지 1학년때와 2학년때 성적은 남에게 보여주기 처참할 정도로 낮았습니다."
"#### 코로나가 유행할 때 저는 군대에 갔습니다. 군대에서 복무를 하면서 많은 생각을 했던 것 같습니다."
"#### 전역 후에는 '이렇게 살면은 안돼겠다' 라고 생각을해 2학년 2학기 복학을 하면서 많이 달라 졌습니다."
"#### 지금껏 학점은 3점대를 볼수도 없었지만 복학을 하면서 열심히 공부하니 3점 중반 까지 갈수 있었습니다."
"#### 덕분에 저는 성적 장학금도 살면서 처음으로 받아 봤습니다."
"#### 열심히 살고 노력을 한다면 무엇이든 할 수 있다는 것을 배웠습니다."
'-------------------------------------------------------------------------'

col1, col2 = st.columns([1 , 2])
with col1:
    st.image('good.jpg')
with col2:
    st.image('team.jpg')


'------------------'

"#### 저는 달라지기 위해 대학활동을 적극적으로 참여하기 시작했습니다."
"#### 친구들과 조를 꾸려 창업경진대회를 나가고 우수한 성적을 거두웠습니다."
"#### 처음에는 우여곡절도 많이 있었지만, 끝나고보니 별거 아니였단 생각이 들었고", " 대회에서 좋은 성적까지 나오니 지금껏 고생한것에 대한 보답을 받았다고 생각 합니다."

'------------------------'
col1, col2 = st.columns([1 , 2])
with col1:
    st.image('XL.jpg')
with col2:
    st.image('XLxl.jpg')

'------------'
"#### 저는 앞으로 이 두가지의 자격증을 취득할 생각입니다."
"#### 취득하기 어렵겠지만 위에서 노력하면 할 수 있다는 것을 배웠기 때문에 두렵지 않습니다."
"#### 자격증을 취득하면 취업하는것이 어렵지만은 않을 것 같습니다."
"#### 하지만 저는 여기서 만족하지는 않을 것입니다."
"#### 자격증 두개 이상을 취득 후에는 소방공무원 시험도 준비해볼 생각입니다."
"#### 합격을 하든 안하든 시도자체는 해봐야 나 자신에게 실망하지 않을 것 같습니다."
"#### 이상입니다 봐주셔서 감사 합니다."
'-------------------'
col1, col2 = st.columns([2 , 2])
with col1:
    st.image('end.jpg')



